package javabasic;

public class Comment {
	public static void main(String[] args) {
		//sysout - 자동완성, 콘솔에 출력 메소드
		//주석 사용하기
		//주석은 프로그램 실행과는 상관없이 코드에
		//설명을 붙인 것을 말합니다.
		//객체 지향 언어의 특징
		//유지 보수성과 확장성 좋다
		//복잡한 코드일수록 주석을 달면 전체 코드를
		//이해하기 쉽고 수정이 용이합니다.
		//주석은 컴파일 과정에서 무시되고 실행문만
		//바이트 코드로 번역됩니다.
		//주석을 많이 작성한다고 해서 바이트 코드 파일의
		//크기가 커지는 것은 아니므로
		//가급적이면 설명이 필요한 코드에 주석을
		//달아두는 것이 좋습니다.
		
		//주석의 기호
		//라인주석 (한줄 주석) - //...
		// //부터 라인 끝까지 주석으로 처리합니다.
		//범위주석 (여러줄 주석) - /* */
		/*
		 * 작성자:김자바
		 * 작성일:2025.04.21
		 */
		System.out.println("Hello, Java");
	}
}



